garyPenhook/PIC-Assembler/edc/PIC18F25Q43.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="---01000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x25B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x1f" edc:name="CWG1INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x1f" edc:name="CWGINPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG2PPS" edc:nzwidth="8" edc:por="---01001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x25C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG2INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG2INPPS" edc:mask="0x1f" edc:name="CWG2INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG2INPPS0" edc:mask="0x1" edc:name="CWG2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2INPPS1" edc:mask="0x1" edc:name="CWG2INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2INPPS2" edc:mask="0x1" edc:name="CWG2INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2INPPS3" edc:mask="0x1" edc:name="CWG2INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2INPPS4" edc:mask="0x1" edc:name="CWG2INPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x1f" edc:name="CWGINPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG3PPS" edc:nzwidth="8" edc:por="---01010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x25D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG3INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG3INPPS" edc:mask="0x1f" edc:name="CWG3INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG3INPPS0" edc:mask="0x1" edc:name="CWG3INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3INPPS1" edc:mask="0x1" edc:name="CWG3INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3INPPS2" edc:mask="0x1" edc:name="CWG3INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3INPPS3" edc:mask="0x1" edc:name="CWG3INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3INPPS4" edc:mask="0x1" edc:name="CWG3INPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x1f" edc:name="CWGINPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD1CARLPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="MD1CARLPPS" edc:nzwidth="8" edc:por="---00011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x25E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MDCARLPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCARLPPS0" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS1" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS2" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS3" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MDCARLPPS4" edc:mask="0x1" edc:name="MDCARLPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MDCARLPPS" edc:mask="0x1f" edc:name="MDCARLPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
