garyPenhook/PIC-Assembler/edc/PIC18F25Q43.PIC
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U4FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U4FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2E9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4RXBF" edc:desc="" edc:mask="0x1" edc:name="U4RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXBE" edc:desc="" edc:mask="0x1" edc:name="U4RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4XON" edc:desc="" edc:mask="0x1" edc:name="U4XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXIDL" edc:desc="" edc:mask="0x1" edc:name="U4RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXBF" edc:desc="" edc:mask="0x1" edc:name="U4TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXBE" edc:desc="" edc:mask="0x1" edc:name="U4TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4STPMD" edc:desc="" edc:mask="0x1" edc:name="U4STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXWRE" edc:desc="" edc:mask="0x1" edc:name="U4TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U4RCIDL" edc:mask="0x1" edc:name="U4RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U4UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U4UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2EA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U4ABDIE" edc:desc="" edc:mask="0x1" edc:name="U4ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U4ABDIF" edc:desc="" edc:mask="0x1" edc:name="U4ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4WUIF" edc:desc="" edc:mask="0x1" edc:name="U4WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U4ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2EB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4TXCIF" edc:desc="" edc:mask="0x1" edc:name="U4TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U4RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U4RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4FERIF" edc:desc="" edc:mask="0x1" edc:name="U4FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CERIF" edc:desc="" edc:mask="0x1" edc:name="U4CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U4ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4PERIF" edc:desc="" edc:mask="0x1" edc:name="U4PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U4TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U4ERRIE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U4ERRIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2EC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIE" edc:desc="" edc:mask="0x1" edc:name="TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIE" edc:desc="" edc:mask="0x1" edc:name="RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIE" edc:desc="" edc:mask="0x1" edc:name="RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIE" edc:desc="" edc:mask="0x1" edc:name="FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIE" edc:desc="" edc:mask="0x1" edc:name="CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVE" edc:desc="" edc:mask="0x1" edc:name="ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIE" edc:desc="" edc:mask="0x1" edc:name="PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIE" edc:desc="" edc:mask="0x1" edc:name="TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4TXCIE" edc:desc="" edc:mask="0x1" edc:name="U4TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXFOIE" edc:desc="" edc:mask="0x1" edc:name="U4RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXBKIE" edc:desc="" edc:mask="0x1" edc:name="U4RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4FERIE" edc:desc="" edc:mask="0x1" edc:name="U4FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CERIE" edc:desc="" edc:mask="0x1" edc:name="U4CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4ABDOVE" edc:desc="" edc:mask="0x1" edc:name="U4ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4PERIE" edc:desc="" edc:mask="0x1" edc:name="U4PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4TXMTIE" edc:desc="" edc:mask="0x1" edc:name="U4TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U5RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2ED">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U5RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
