garyPenhook/PIC-Assembler/edc/PIC18F25Q43.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2EE"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2EF">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U5TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2F0"/>
        <edc:JoinedSFRDef edc:cname="U5P1" edc:desc="" edc:name="U5P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2F2"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U5P2" edc:desc="" edc:name="U5P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2L" edc:desc="" edc:mask="0xff" edc:name="P2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2F4"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U5P3" edc:desc="" edc:name="U5P3" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5P3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="U5P3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3L" edc:desc="" edc:mask="0xff" edc:name="P3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2F6"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U5CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U5CON0" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U5MODE" edc:desc="" edc:mask="0x7" edc:name="U5MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="U5RXEN" edc:desc="" edc:mask="0x1" edc:name="U5RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5TXEN" edc:desc="" edc:mask="0x1" edc:name="U5TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5ABDEN" edc:desc="" edc:mask="0x1" edc:name="U5ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5BRGS" edc:desc="" edc:mask="0x1" edc:name="U5BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U5MODE0" edc:desc="" edc:mask="0x1" edc:name="U5MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5MODE1" edc:desc="" edc:mask="0x1" edc:name="U5MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5MODE2" edc:desc="" edc:mask="0x1" edc:name="U5MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGS" edc:desc="" edc:mask="0x1" edc:name="BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nn-nn" edc:cname="U5CON1" edc:desc="" edc:impl="0x9b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00-00" edc:name="U5CON1" edc:nzwidth="8" edc:por="0--00-00" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRKOVR" edc:desc="" edc:mask="0x1" edc:name="BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXBIMD" edc:desc="" edc:mask="0x1" edc:name="RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U5SENDB" edc:desc="" edc:mask="0x1" edc:name="U5SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5BRKOVR" edc:desc="" edc:mask="0x1" edc:name="U5BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U5RXBIMD" edc:desc="" edc:mask="0x1" edc:name="U5RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5WUE" edc:desc="" edc:mask="0x1" edc:name="U5WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U5ON" edc:desc="" edc:mask="0x1" edc:name="U5ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U5CON2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U5CON2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2F9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U5FLO" edc:desc="" edc:mask="0x3" edc:name="U5FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U5TXPOL" edc:desc="" edc:mask="0x1" edc:name="U5TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U5STP" edc:desc="" edc:mask="0x3" edc:name="U5STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U5RXPOL" edc:desc="" edc:mask="0x1" edc:name="U5RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U5RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U5FLO0" edc:desc="" edc:mask="0x1" edc:name="U5FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5FLO1" edc:desc="" edc:mask="0x1" edc:name="U5FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U5STP0" edc:desc="" edc:mask="0x1" edc:name="U5STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5STP1" edc:desc="" edc:mask="0x1" edc:name="U5STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U5BRG" edc:desc="" edc:name="U5BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FA">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U5BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U5FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U5FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U5RXBF" edc:desc="" edc:mask="0x1" edc:name="U5RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5RXBE" edc:desc="" edc:mask="0x1" edc:name="U5RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5XON" edc:desc="" edc:mask="0x1" edc:name="U5XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5RXIDL" edc:desc="" edc:mask="0x1" edc:name="U5RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5TXBF" edc:desc="" edc:mask="0x1" edc:name="U5TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5TXBE" edc:desc="" edc:mask="0x1" edc:name="U5TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5STPMD" edc:desc="" edc:mask="0x1" edc:name="U5STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5TXWRE" edc:desc="" edc:mask="0x1" edc:name="U5TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U5RCIDL" edc:mask="0x1" edc:name="U5RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U5UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U5UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U5ABDIE" edc:desc="" edc:mask="0x1" edc:name="U5ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U5ABDIF" edc:desc="" edc:mask="0x1" edc:name="U5ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5WUIF" edc:desc="" edc:mask="0x1" edc:name="U5WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U5ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U5ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2FE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U5TXCIF" edc:desc="" edc:mask="0x1" edc:name="U5TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U5RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U5RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5FERIF" edc:desc="" edc:mask="0x1" edc:name="U5FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5CERIF" edc:desc="" edc:mask="0x1" edc:name="U5CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U5ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5PERIF" edc:desc="" edc:mask="0x1" edc:name="U5PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U5TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U5TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
