garyPenhook/PIC-Assembler/edc/PIC18F25Q43.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x352">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC8" edc:desc="" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:desc="" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:desc="" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:desc="" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:desc="" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:desc="" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:desc="" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:desc="" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCSHFT" edc:desc="" edc:name="CRCSHFT" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x353">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHIFTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x353">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHFT0" edc:desc="" edc:mask="0x1" edc:name="SHFT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT1" edc:desc="" edc:mask="0x1" edc:name="SHFT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT2" edc:desc="" edc:mask="0x1" edc:name="SHFT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT3" edc:desc="" edc:mask="0x1" edc:name="SHFT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT4" edc:desc="" edc:mask="0x1" edc:name="SHFT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT5" edc:desc="" edc:mask="0x1" edc:name="SHFT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT6" edc:desc="" edc:mask="0x1" edc:name="SHFT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT7" edc:desc="" edc:mask="0x1" edc:name="SHFT7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHIFTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x354">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHFT8" edc:desc="" edc:mask="0x1" edc:name="SHFT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT9" edc:desc="" edc:mask="0x1" edc:name="SHFT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT10" edc:desc="" edc:mask="0x1" edc:name="SHFT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT11" edc:desc="" edc:mask="0x1" edc:name="SHFT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT12" edc:desc="" edc:mask="0x1" edc:name="SHFT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT13" edc:desc="" edc:mask="0x1" edc:name="SHFT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT14" edc:desc="" edc:mask="0x1" edc:name="SHFT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SHFT15" edc:desc="" edc:mask="0x1" edc:name="SHFT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCXOR" edc:desc="" edc:name="CRCXOR" edc:nzwidth="0x10" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x355">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnn-" edc:cname="CRCXORL" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxx1" edc:name="CRCXORL" edc:nzwidth="8" edc:por="xxxxxxx1" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x355">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="X1" edc:desc="" edc:mask="0x1" edc:name="X1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X2" edc:desc="" edc:mask="0x1" edc:name="X2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X3" edc:desc="" edc:mask="0x1" edc:name="X3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X4" edc:desc="" edc:mask="0x1" edc:name="X4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X5" edc:desc="" edc:mask="0x1" edc:name="X5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X6" edc:desc="" edc:mask="0x1" edc:name="X6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X7" edc:desc="" edc:mask="0x1" edc:name="X7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCXORH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x356">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="X8" edc:desc="" edc:mask="0x1" edc:name="X8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X9" edc:desc="" edc:mask="0x1" edc:name="X9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X10" edc:desc="" edc:mask="0x1" edc:name="X10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X11" edc:desc="" edc:mask="0x1" edc:name="X11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X12" edc:desc="" edc:mask="0x1" edc:name="X12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X13" edc:desc="" edc:mask="0x1" edc:name="X13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X14" edc:desc="" edc:mask="0x1" edc:name="X14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="X15" edc:desc="" edc:mask="0x1" edc:name="X15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrn--nr" edc:cname="CRCCON0" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x357">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FULL" edc:desc="" edc:mask="0x1" edc:name="FULL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHIFTM" edc:desc="" edc:mask="0x1" edc:name="SHIFTM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ACCM" edc:desc="" edc:mask="0x1" edc:name="ACCM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CRCEN" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02451_math_progcrc_v4_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x358">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xf" edc:name="PLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DLEN" edc:desc="" edc:mask="0xf" edc:name="DLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN0" edc:desc="" edc:mask="0x1" edc:name="DLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN1" edc:desc="" edc:mask="0x1" edc:name="DLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN2" edc:desc="" edc:mask="0x1" edc:name="DLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN3" edc:desc="" edc:mask="0x1" edc:name="DLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x359"/>
        <edc:JoinedSFRDef edc:cname="SCANLADR" edc:desc="" edc:name="SCANLADR" edc:nzwidth="0x10" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR0" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR1" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR2" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR3" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR4" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR5" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR6" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR7" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR0" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR1" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR2" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR3" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR4" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR5" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR6" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR7" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR8" edc:mask="0x1" edc:name="LADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR9" edc:mask="0x1" edc:name="LADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR10" edc:mask="0x1" edc:name="LADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR11" edc:mask="0x1" edc:name="LADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR12" edc:mask="0x1" edc:name="LADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR13" edc:mask="0x1" edc:name="LADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR14" edc:mask="0x1" edc:name="LADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR15" edc:mask="0x1" edc:name="LADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR8" edc:mask="0x1" edc:name="SCANLADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR9" edc:mask="0x1" edc:name="SCANLADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR10" edc:mask="0x1" edc:name="SCANLADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR11" edc:mask="0x1" edc:name="SCANLADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR12" edc:mask="0x1" edc:name="SCANLADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR13" edc:mask="0x1" edc:name="SCANLADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR14" edc:mask="0x1" edc:name="SCANLADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR15" edc:mask="0x1" edc:name="SCANLADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANLADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="SCANLADRU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0x3f" edc:name="LADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR16" edc:mask="0x1" edc:name="LADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR17" edc:mask="0x1" edc:name="LADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR18" edc:mask="0x1" edc:name="LADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR19" edc:mask="0x1" edc:name="LADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR20" edc:mask="0x1" edc:name="LADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR21" edc:mask="0x1" edc:name="LADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0x3f" edc:name="SCANLADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR16" edc:mask="0x1" edc:name="SCANLADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR17" edc:mask="0x1" edc:name="SCANLADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR18" edc:mask="0x1" edc:name="SCANLADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR19" edc:mask="0x1" edc:name="SCANLADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR20" edc:mask="0x1" edc:name="SCANLADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR21" edc:mask="0x1" edc:name="SCANLADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SCANHADR" edc:desc="" edc:name="SCANHADR" edc:nzwidth="0x10" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35D">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR0" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR1" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR2" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR3" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR4" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR5" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR6" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR7" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR0" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR1" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR2" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR3" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR4" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR5" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR6" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR7" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
