garyPenhook/PIC-Assembler/edc/PIC18F25Q43.PIC
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO3INCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO3INCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x455">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xf" edc:name="INC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3INC16" edc:desc="" edc:mask="0x1" edc:name="NCO3INC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC17" edc:desc="" edc:mask="0x1" edc:name="NCO3INC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC18" edc:desc="" edc:mask="0x1" edc:name="NCO3INC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3INC19" edc:desc="" edc:mask="0x1" edc:name="NCO3INC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC16" edc:mask="0x1" edc:name="INC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC17" edc:mask="0x1" edc:name="INC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC18" edc:mask="0x1" edc:name="INC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC19" edc:mask="0x1" edc:name="INC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3INC" edc:mask="0xf" edc:name="NCO3INC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="NCO3CON" edc:desc="Configurable logic cell control" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="NCO3CON" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x456">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PFM" edc:desc="" edc:mask="0x1" edc:name="PFM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NCO3PFM" edc:mask="0x1" edc:name="NCO3PFM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NCO3POL" edc:mask="0x1" edc:name="NCO3POL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3OUT" edc:mask="0x1" edc:name="NCO3OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCO3EN" edc:mask="0x1" edc:name="NCO3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO3CLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO3CLK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x457">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKS" edc:desc="" edc:mask="0x1f" edc:name="CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="PWS" edc:desc="" edc:mask="0x7" edc:name="PWS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKS0" edc:mask="0x1" edc:name="CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS1" edc:mask="0x1" edc:name="CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS2" edc:mask="0x1" edc:name="CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS3" edc:mask="0x1" edc:name="CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS4" edc:mask="0x1" edc:name="CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS0" edc:mask="0x1" edc:name="PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS1" edc:mask="0x1" edc:name="PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS2" edc:mask="0x1" edc:name="PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NCO3CKS" edc:mask="0x1f" edc:name="NCO3CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="NCO3PWS" edc:mask="0x7" edc:name="NCO3PWS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="NCO3CKS0" edc:mask="0x1" edc:name="NCO3CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3CKS1" edc:mask="0x1" edc:name="NCO3CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3CKS2" edc:mask="0x1" edc:name="NCO3CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3CKS3" edc:mask="0x1" edc:name="NCO3CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3CKS4" edc:mask="0x1" edc:name="NCO3CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3PWS0" edc:mask="0x1" edc:name="NCO3PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3PWS1" edc:mask="0x1" edc:name="NCO3PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3PWS2" edc:mask="0x1" edc:name="NCO3PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x458"/>
        <edc:SFRDef edc:access="-------n" edc:cname="IVTLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="IVTLOCK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x459">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVTLOCKED" edc:desc="" edc:mask="0x1" edc:name="IVTLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="IVTAD" edc:desc="" edc:name="IVTAD" edc:nzwidth="0x10" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD0" edc:mask="0x1" edc:name="AD0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD1" edc:mask="0x1" edc:name="AD1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD2" edc:mask="0x1" edc:name="AD2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD3" edc:mask="0x1" edc:name="AD3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD4" edc:mask="0x1" edc:name="AD4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD5" edc:mask="0x1" edc:name="AD5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD6" edc:mask="0x1" edc:name="AD6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD7" edc:mask="0x1" edc:name="AD7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD8" edc:mask="0x1" edc:name="AD8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD9" edc:mask="0x1" edc:name="AD9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD10" edc:mask="0x1" edc:name="AD10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD11" edc:mask="0x1" edc:name="AD11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD12" edc:mask="0x1" edc:name="AD12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD13" edc:mask="0x1" edc:name="AD13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD14" edc:mask="0x1" edc:name="AD14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD15" edc:mask="0x1" edc:name="AD15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrnnnnn" edc:cname="IVTADU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADU" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD16" edc:mask="0x1" edc:name="AD16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD17" edc:mask="0x1" edc:name="AD17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD18" edc:mask="0x1" edc:name="AD18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD19" edc:mask="0x1" edc:name="AD19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD20" edc:mask="0x1" edc:name="AD20" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
